[
  {
    "question": "How much fuel did Lufthansa save by shutting down one engine during parking in 2024?",
    "ground_truth_answer": "Up to 2750 tonnes",
    "contexts": [
      "We have communicated this efficiency topic with our own campaign.",
      "This application can save around 2,500 tonnes of kerosene per year in flight operations as a whole.",
      "An additional 250 tonnes of kerosene can now be saved through the use of these two measures."
    ],
    "metadata": {
      "page": 19,
      "report": "Lufthansa Sustainability 2024"
    }
  },
  {
    "question": "What is the carbon dioxide emissions for Lufthansa in 2023 compared to 2022?",
    "ground_truth_answer": "12,986,772 tonnes in 2023 vs 11,194,537 tonnes in 2022.",
    "contexts": [
      "In 2023, carbon dioxide emissions from flight operations were 12,986,772 tonnes.",
      "In 2022, they were 11,194,537 tonnes."
    ],
    "metadata": {
      "page": 26,
      "report": "Lufthansa Sustainability 2024"
    }
  },
  {
    "question": "By how many % did Fuel consumption, specific, passenger transport change for Lufthansa in 2023 compared to 2022?",
    "ground_truth_answer": "It has increased by 0.28% l/100pkm.",
    "contexts": [
      "In 2023, Fuel consumption, specific, passenger transport was 3.51 l/100pkm.",
      "In 2022, Fuel consumption, specific, passenger transport was 3.50 l/100pkm."
    ],
    "metadata": {
      "page": 26,
      "report": "Lufthansa Sustainability 2024"
    }
  },
  {
  "question": "How much SAF did KLM use in flight operations in 2024?",
  "ground_truth_answer": "57 kilotonnes",
  "contexts": [
    "In 2024, KLM used 57 kilotonnes of Sustainable Aviation Fuel (SAF) in flight operations.",
    "In 2023, SAF usage was 49 kilotonnes."
  ],
  "metadata": {
    "page": 42,
    "report": "KLM Sustainability 2024"
  }
  },
  {
  "question": "What were KLM’s Scope 3 emissions from Well-To-Wake flight ops fuel in 2024?",
  "ground_truth_answer": "2,637 kilotonnes of CO2",
  "contexts": [
    "Scope 3 emissions from Well-To-Wake flight operations fuel were 2,637 kilotonnes CO2 in 2024.",
    "This compares to 2,538 kilotonnes in 2023."
  ],
  "metadata": {
    "page": 42,
    "report": "KLM Sustainability 2024"
  }
  }, 
  {
  "question": "What key policies and initiatives does KLM outline under its “Improve for the future” pillar to make flying cleaner, quieter, and more efficient?",
  "ground_truth_answer": "KLM’s “Improve for the future” pillar includes: 1) a Science Based Targets–aligned roadmap to reduce GHG in line with the Paris Agreement; 2) fleet renewal targeting 80% next-gen aircraft by 2030 to cut noise by 30–60%; 3) blending at least 2% SAF by end-2024 (with voluntary top-ups and upcoming mandatory surcharges from 2025); 4) operational measures such as OptiClimb, single-engine taxiing, and continuous descent to optimise fuel use; and 5) electrification of ground support equipment to achieve zero-emission operations on the ground by 2030.",
  "contexts": [
    "“KLM has developed a future-oriented roadmap to reduce its emissions and alongside Air France, targets are set based on the Science Based Targets Initiative (SBTi)...”",
    "“Investing in a more fuel-efficient fleet is the most effective way to reducing our carbon footprint. KLM is in the process of acquiring modern, high-performance aircraft... consisting of up to 80 per cent next generation aircraft by 2030.”",
    "“By the end of 2024, KLM blended a rounded 2 per cent SAF, in accordance with the EU mandate that applies as from 2025. Alongside the mandatory SAF surcharge starting in 2025, we offer customers the option to voluntarily contribute to extra SAF usage.”",
    "“In 2024, for example, we implemented OptiClimb on all KLM Cityhopper flights... single-engine taxiing, and continuous descent approaches also enhance fuel efficiency.”",
    "“KLM’s strategy aspiring to achieve zero emissions on the ground by 2030, includes electrifying equipment at Schiphol Airport... the electrification rate of ground support equipment (GSE) reached 69.2 per cent.”"
  ],
  "metadata": {
    "page": 39,
    "report": "KLM Annual Report 2024"
  }
  },
  {
  "question": "Which regulatory framework does KLM refer to in its 2024 sustainability report?",
  "ground_truth_answer": "KLM refers to the Corporate Sustainability Reporting Directive (CSRD) and complies with European Sustainability Reporting Standards (ESRS) for the 2024 financial year.",
  "contexts": [
    "The Corporate Sustainability Reporting Directive (CSRD) is a framework established by the European Union (EU).",
    "The sustainability statement for the 2024 financial year has been prepared and presented by Air France–KLM S.A., in compliance with the applicable European Sustainability Reporting Standards (ESRS standards)."
  ],
  "metadata": {
    "page": 29,
    "report": "KLM Sustainability 2024"
  }
  },
  {
  "question": "What policy mechanisms and national actions are supporting the development of the sustainable aviation fuel (SAF) industry globally and in Australia?",
  "ground_truth_answer": "Globally, SAF development is supported through blending mandates, subsidies, and revenue support mechanisms in regions such as the EU, US, UK, and Asia. In Australia, Qantas is advocating for a domestic SAF industry with a policy framework combining 'demand side' mandates and 'supply side' financial incentives.",
  "contexts": [
    "The EU has enacted progressive blending mandates including sub-mandates for e-fuels.",
    "The US has financial incentives and support mechanisms for producers.",
    "The UK plans to legislate for producer revenue support mechanisms in 2025.",
    "Asia and Japan are introducing SAF blending mandates, and Singapore proposes a levy on all departing flights.",
    "Qantas is advocating for a domestic SAF sector in Australia and supports a policy mix of mandates and financial incentives."
  ],
  "metadata": {
    "page": 28,
    "report": "Qantas Sustainability 2024"
  }
  },
  {
  "question": "By how much did KLM increase its use of Sustainable Aviation Fuel (SAF) in 2024 compared to 2023, and what was the percentage increase?",
  "ground_truth_answer": "KLM increased its SAF usage from 49 kilotonnes in 2023 to 57 kilotonnes in 2024, which is an increase of 8 kilotonnes or approximately 16.3%.",
  "contexts": [
    "In 2023, KLM used 49 kilotonnes of Sustainable Aviation Fuel (SAF).",
    "In 2024, this increased to 57 kilotonnes.",
    "This represents a 17.1% increase year-over-year as shown in the delta column."
  ],
  "metadata": {
    "page": 42,
    "report": "KLM Sustainability 2024"
  }
},
{
  "question": "How much did Qantas's SAF usage increase from FY23 to FY24, both in litres and in percentage terms?",
  "ground_truth_answer": "Qantas's SAF usage increased from 8,508,616 litres in FY23 to 9,991,377 litres in FY24 — an increase of 1,482,761 litres or approximately 17.4%.",
  "contexts": [
    "SAF uptake was 9,991,377 litres in FY24 and 8,508,616 litres in FY23.",
    "This represents an increase of 1,482,761 litres year-over-year, or roughly 17.4%."
  ],
  "metadata": {
    "page": 88,
    "report": "Qantas Sustainability 2024"
  }
},
{
  "question": "What was the average percentage increase in aviation fuel consumption from 2023 to 2024 across Qantas and KLM?",
  "ground_truth_answer": "Qantas increased aviation fuel consumption from 3,847,941,000 L in FY23 to 4,540,502,000 L in FY24 — an 18% increase. KLM increased from 9,972 kilotonnes in 2023 to 10,360 kilotonnes in 2024 — a 3.9% increase. The average increase across both airlines is approximately 10.95%.",
  "contexts": [
    "Qantas aviation fuel consumption was 3,847,941,000 litres in FY23 and 4,540,502,000 litres in FY24, representing an 18% increase.",
    "KLM's Scope 1 aviation fuel flight operations emissions increased from 9,972 kilotonnes in 2023 to 10,360 kilotonnes in 2024, a 3.9% increase."
  ],
  "metadata": {
    "page": [42, 88],
    "report": ["KLM Sustainability 2024", "Qantas Sustainability 2024"]
  }
},
{
  "question": "Which airline had a higher percentage increase in SAF usage between 2022–23 and 2023–24: Emirates or Qantas?",
  "ground_truth_answer": "Emirates had a SAF usage increase from 179 tonnes in 2022–23 to 1,297 tonnes in 2023–24, which is a 624.6% increase. Qantas increased from 8,508,616 litres to 9,991,377 litres, a 17.4% increase. Therefore, Emirates had a significantly higher percentage increase in SAF usage.",
  "contexts": [
    "Emirates increased its sustainable aviation fuel (SAF) usage from 179 tonnes in 2022–23 to 1,297 tonnes in 2023–24 — a 624.6% increase.",
    "Qantas increased SAF usage from 8,508,616 litres in FY23 to 9,991,377 litres in FY24, representing a 17.4% increase."
  ],
  "metadata": {
    "page": [88, 76],
    "report": ["Qantas Sustainability 2024", "Emirates Sustainability 2023–2024"]
  }
},
{
  "question": "How did Emirates' carbon monoxide (CO) emissions change from 2022–23 to 2023–24, and what was the percentage increase?",
  "ground_truth_answer": "Emirates' carbon monoxide emissions increased from 6,088 tonnes in 2022–23 to 7,009 tonnes in 2023–24, which is an increase of 921 tonnes or approximately 15.1%.",
  "contexts": [
    "Carbon monoxide (CO) emissions (landing and take-off cycle) were 6,088 tonnes in 2022–23.",
    "They increased to 7,009 tonnes in 2023–24, representing a 15.1% rise."
  ],
  "metadata": {
    "page": 76,
    "report": "Emirates Sustainability Report 2023–2024"
  }
},
{
  "question": "How do Emirates' and Lufthansa's carbon monoxide (CO) emissions from flight operations compare in 2023?",
  "ground_truth_answer": "In 2023, Emirates reported 7,009 tonnes of CO emissions from flight operations, while Lufthansa reported 9,083 tonnes. Lufthansa emitted approximately 2,074 tonnes more than Emirates, which is about 29.6% higher.",
  "contexts": [
    "Emirates reported 7,009 tonnes of carbon monoxide emissions from flight operations in 2023.",
    "Lufthansa reported 9,083 tonnes of carbon monoxide emissions from flight operations in 2023.",
    "The difference between the two is 2,074 tonnes, with Lufthansa emitting approximately 29.6% more."
  ],
  "metadata": {
    "page": [76, 26],
    "report": ["Emirates Sustainability Report 2023–2024", "Lufthansa Environmental Statement 2024"]
  }
},
{
  "question": "What are the key policy and strategic measures KLM is implementing to support the use of Sustainable Aviation Fuel (SAF) by 2025 and beyond?",
  "ground_truth_answer": "KLM is complying with an EU mandate to blend 2% SAF by the end of 2024, ahead of its mandatory start in 2025. It offers voluntary SAF contribution options to customers, launched SAF initiatives via Transavia, and participates in Project SkyPower to scale e-SAF production. The SAF surcharge will also become mandatory in 2025.",
  "contexts": [
    "By the end of 2024, KLM blended a rounded 2 per cent SAF, in accordance with the EU mandate that applies from 2025.",
    "KLM offers customers the option to voluntarily contribute to extra SAF usage.",
    "Transavia launched a SAF initiative enabling passengers to opt for a SAF contribution.",
    "Air France–KLM is initiator and KLM is co-chair of Project SkyPower, aiming to scale up e-SAF production from renewable sources.",
    "The SAF surcharge will become mandatory starting in 2025."
  ],
  "metadata": {
    "page": 39,
    "report": "KLM Sustainability Report 2024"
  }
},
{
  "question": "What operational policies and efficiency initiatives has Lufthansa implemented to reduce fuel consumption and CO₂ emissions as of 2023–2024?",
  "ground_truth_answer": "Lufthansa implemented several efficiency measures, including switching off engines during taxi-in, which saves up to 2,750 tonnes of kerosene annually. They also reduced aircraft weight by repainting planes to remove old paint layers (saving 4.1 tonnes across 30 aircraft) and optimized freshwater loading on Boeing aircraft, saving 700 tonnes of kerosene per year. These initiatives support Lufthansa’s broader OPS Sustainability Programme targeting CO₂ reduction by 2030.",
  "contexts": [
    "Lufthansa saves up to 2,750 tonnes of kerosene per year by shutting down one or more engines while taxiing.",
    "Aircraft repainting saved 4.1 tonnes of weight across 30 planes in 2023.",
    "Optimisation of freshwater volumes on B747 and B787 fleets saved around 700 tonnes of kerosene annually.",
    "All Lufthansa flight operations participate in the OPS Sustainability Programme targeting CO₂ reductions by 2030."
  ],
  "metadata": {
    "page": 19,
    "report": "Lufthansa Environmental Statement 2024"
  }
},
{
  "question": "What core principles define Lufthansa’s corporate environmental policy as of 2024?",
  "ground_truth_answer": "Lufthansa's environmental policy is guided by the principle that environmental care is a primary corporate goal. It emphasizes sustainable management, use of renewable resources, avoiding emissions and waste, and integrating environmental protection into decision-making and employee responsibility.",
  "contexts": [
    "Environmental care is a primary corporate goal.",
    "We are led by the guiding principle of sustainable business.",
    "We avoid environmental impacts such as emissions, noise, waste, and wastewater whenever possible.",
    "We assess the consequences for the environment before we make decisions.",
    "Environmental protection is everyone's responsibility."
  ],
  "metadata": {
    "page": 16,
    "report": "Lufthansa Environmental Statement 2024"
  }
},

{
    "question": "How does Lufthansa ensure that its environmental policy is implemented and adapted over time?",
    "ground_truth_answer": "Lufthansa monitors the effects of its actions on the environment, sets environmental goals, and regularly updates its guidelines to reflect new research, technology, and social debate. The policy is enforced company-wide and documented in regularly published environmental reports.",
    "contexts": [
      "We record and evaluate the effects of our actions on the environment.",
      "Environmental care goals are documented and continuously improved.",
      "Our guidelines will be updated on an ongoing basis in line with developments in research and technology as well as social debate.",
      "We engage in constructive dialogue with authorities and the public.",
      "The regularly published environmental report forms the basis of this communication."
    ],
    "metadata": {
      "page": 16,
      "report": "Lufthansa Environmental Statement 2024"
    }
},
{
    "question": "By how much did Qantas Group’s Scope 3 CO₂ emissions increase from FY23 to FY24, both in absolute and percentage terms?",
    "ground_truth_answer": "Qantas Group's Scope 3 CO₂ emissions increased from 3,182,594 tonnes in FY23 to 6,094,185 tonnes in FY24. This is an increase of 2,911,591 tonnes, or approximately 91.5%.",
    "contexts": [
      "In FY24, Scope 3 CO₂ emissions were 6,094,185 tonnes.",
      "In FY23, Scope 3 emissions were 3,182,594 tonnes.",
      "The absolute increase was 2,911,591 tonnes, which corresponds to a 91.5% rise year-over-year."
    ],
    "metadata": {
      "page": 88,
      "report": "Qantas Sustainability Report 2024"
    }
},
{
  "question": "What was the average percentage increase in SAF usage from 2023 to 2024 across both Qantas and KLM?",
  "ground_truth_answer": "Qantas increased SAF usage by 17.4%, and KLM by 17.1%. The average percentage increase across both airlines is approximately 17.25%.",
  "contexts": [
    "Qantas increased SAF uptake from 8,508,616 litres in FY23 to 9,991,377 litres in FY24, a 17.4% increase.",
    "KLM increased SAF usage from 49 kilotonnes in 2023 to 57 kilotonnes in 2024, a 17.1% increase."
  ],
  "metadata": {
    "page": [42, 88],
    "report": ["KLM Sustainability 2024", "Qantas Sustainability 2024"]
  }
},
{
  "question": "By what percentage did KLM’s aviation fuel CO₂ emissions change in 2022 compared to 2021?",
  "ground_truth_answer": "+23% (9,041 ktons in 2022 vs 7,370 ktons in 2021).",
  "contexts": [
    "Aviation fuel (in kt CO₂): 9,041 in 2022, 7,370 in 2021 (Δ +23%)."
  ],
  "metadata": {
    "page": 54,
    "report": "KLM Annual Report 2022"
  }
},
{
  "question": "How did KLM’s CO₂ savings from SAF change in 2022 compared to 2021?",
  "ground_truth_answer": "CO₂ savings from SAF rose from 9.8 ktons in 2021 to 87 ktons in 2022, a 785% increase.",
  "contexts": [
    "CO₂ savings from SAF (in ktons CO₂): 87 in 2022 vs 9.8 in 2021 (Δ +785%)."
  ],
  "metadata": {
    "page": 54,
    "report": "KLM Annual Report 2022"
  }
},
{
  "question": "What were Lufthansa’s total CO₂ emissions in 2021, and how did this compare to 2020?",
  "ground_truth_answer": "In 2021, total CO₂ emissions were 13,622,950 tonnes, a 23.3% increase over 2020.",
  "contexts": [
    "Total CO₂ emissions in 2021: 13,622,950 tonnes (Passengers: 9,100,317 t; Freight: 4,522,633 t), Δ +23.3% vs prior year."
  ],
  "metadata": {
    "page": 15,
    "report": "Lufthansa Fact Sheet Sustainability 2021"
  }
},
{
  "question": "What standard does Lufthansa apply to calculate its greenhouse gas emissions for transport processes, and since when has that standard existed?",
  "ground_truth_answer": "Lufthansa applies the DIN EN 16258 standard for calculating greenhouse gas emissions in transport processes, and this standard has existed since 2013.",
  "contexts": [
    "The DIN EN 16258 standard has existed since 2013 to provide a framework for calculating the greenhouse gas emissions for transport processes in a consistent way.",
    "The Lufthansa Group applies this framework when it comes to allocating payloads."
  ],
  "metadata": {
    "page": 22,
    "report": "Lufthansa Fact Sheet Sustainability 2021"
  }
}, 
{
  "question": "How much Sustainable Aviation Fuel (SAF) did Emirates use in 2021–22, and what was the percentage change from 2020–21?",
  "ground_truth_answer": "Emirates used 153 tonnes of SAF in 2021–22, up from 77 tonnes in 2020–21—a 98.7% increase.",
  "contexts": [
    "Sustainable aviation fuel: 153 tonnes in 2021–22 vs 77 tonnes in 2020–21 (Δ +98.7%)."
  ],
  "metadata": {
    "page": 62,
    "report": "Emirates Annual Report 2021–22"
  }
}




]
